In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\dydeh\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

'Connected: root@galaxy'

In [4]:
%%sql
CREATE TABLE Physician (
  EmployeeID INTEGER NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  POSITION VARCHAR(30) NOT NULL,
  SSN INTEGER NOT NULL,
  CONSTRAINT pk_physician PRIMARY KEY(EmployeeID)
); 

CREATE TABLE Department (
  DepartmentID INTEGER NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  Head INTEGER NOT NULL,
  CONSTRAINT pk_Department PRIMARY KEY(DepartmentID),
  CONSTRAINT fk_Department_Physician_EmployeeID FOREIGN KEY(Head) REFERENCES Physician(EmployeeID)
);


CREATE TABLE Affiliated_With (
  Physician INTEGER NOT NULL,
  Department INTEGER NOT NULL,
  PrimaryAffiliation BOOLEAN NOT NULL,
  CONSTRAINT fk_Affiliated_With_Physician_EmployeeID FOREIGN KEY(Physician) REFERENCES Physician(EmployeeID),
  CONSTRAINT fk_Affiliated_With_Department_DepartmentID FOREIGN KEY(Department) REFERENCES Department(DepartmentID),
  PRIMARY KEY(Physician, Department)
);

CREATE TABLE Procedures (
  CODE INTEGER PRIMARY KEY NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  Cost REAL NOT NULL
);

CREATE TABLE Trained_In (
  Physician INTEGER NOT NULL,
  Treatment INTEGER NOT NULL,
  CertificationDate DATETIME NOT NULL,
  CertificationExpires DATETIME NOT NULL,
  CONSTRAINT fk_Trained_In_Physician_EmployeeID FOREIGN KEY(Physician) REFERENCES Physician(EmployeeID),
  CONSTRAINT fk_Trained_In_Procedures_Code FOREIGN KEY(Treatment) REFERENCES Procedures(CODE),
  PRIMARY KEY(Physician, Treatment)
);

CREATE TABLE Patient (
  SSN INTEGER PRIMARY KEY NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  Address VARCHAR(30) NOT NULL,
  Phone VARCHAR(30) NOT NULL,
  InsuranceID INTEGER NOT NULL,
  PCP INTEGER NOT NULL,
  CONSTRAINT fk_Patient_Physician_EmployeeID FOREIGN KEY(PCP) REFERENCES Physician(EmployeeID)
);

CREATE TABLE Nurse (
  EmployeeID INTEGER PRIMARY KEY NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  POSITION VARCHAR(30) NOT NULL,
  Registered BOOLEAN NOT NULL,
  SSN INTEGER NOT NULL
);

CREATE TABLE Appointment (
  AppointmentID INTEGER PRIMARY KEY NOT NULL,
  Patient INTEGER NOT NULL,    
  PrepNurse INTEGER,
  Physician INTEGER NOT NULL,
  START DATETIME NOT NULL,
  END DATETIME NOT NULL,
  ExaminationRoom TEXT NOT NULL,
  CONSTRAINT fk_Appointment_Patient_SSN FOREIGN KEY(Patient) REFERENCES Patient(SSN),
  CONSTRAINT fk_Appointment_Nurse_EmployeeID FOREIGN KEY(PrepNurse) REFERENCES Nurse(EmployeeID),
  CONSTRAINT fk_Appointment_Physician_EmployeeID FOREIGN KEY(Physician) REFERENCES Physician(EmployeeID)
);

CREATE TABLE Medication (
  CODE INTEGER PRIMARY KEY NOT NULL,
  NAME VARCHAR(30) NOT NULL,
  Brand VARCHAR(30) NOT NULL,
  DESCRIPTION VARCHAR(30) NOT NULL
);


CREATE TABLE Prescribes (
  Physician INTEGER NOT NULL,
  Patient INTEGER NOT NULL, 
  Medication INTEGER NOT NULL, 
  DATE DATETIME NOT NULL,
  Appointment INTEGER,  
  Dose VARCHAR(30) NOT NULL,
  PRIMARY KEY(Physician, Patient, Medication, DATE),
  CONSTRAINT fk_Prescribes_Physician_EmployeeID FOREIGN KEY(Physician) REFERENCES Physician(EmployeeID),
  CONSTRAINT fk_Prescribes_Patient_SSN FOREIGN KEY(Patient) REFERENCES Patient(SSN),
  CONSTRAINT fk_Prescribes_Medication_Code FOREIGN KEY(Medication) REFERENCES Medication(CODE),
  CONSTRAINT fk_Prescribes_Appointment_AppointmentID FOREIGN KEY(Appointment) REFERENCES Appointment(AppointmentID)
);

CREATE TABLE BLOCK (
  BlockFloor INTEGER NOT NULL,
  BlockCode INTEGER NOT NULL,
  PRIMARY KEY(BlockFloor, BlockCode)
); 

CREATE TABLE Room (
  RoomNumber INTEGER PRIMARY KEY NOT NULL,
  RoomType VARCHAR(30) NOT NULL,
  BlockFloor INTEGER NOT NULL,  
  BlockCode INTEGER NOT NULL,  
  Unavailable BOOLEAN NOT NULL,
  CONSTRAINT fk_Room_Block_PK FOREIGN KEY(BlockFloor, BlockCode) REFERENCES BLOCK(BlockFloor, BlockCode)
);

CREATE TABLE On_Call (
  Nurse INTEGER NOT NULL,
  BlockFloor INTEGER NOT NULL, 
  BlockCode INTEGER NOT NULL,
  OnCallStart DATETIME NOT NULL,
  OnCallEnd DATETIME NOT NULL,
  PRIMARY KEY(Nurse, BlockFloor, BlockCode, OnCallStart, OnCallEnd),
  CONSTRAINT fk_OnCall_Nurse_EmployeeID FOREIGN KEY(Nurse) REFERENCES Nurse(EmployeeID),
  CONSTRAINT fk_OnCall_Block_Floor FOREIGN KEY(BlockFloor, BlockCode) REFERENCES BLOCK(BlockFloor, BlockCode) 
);

CREATE TABLE Stay (
  StayID INTEGER PRIMARY KEY NOT NULL,
  Patient INTEGER NOT NULL,
  Room INTEGER NOT NULL,
  StayStart DATETIME NOT NULL,
  StayEnd DATETIME NOT NULL,
  CONSTRAINT fk_Stay_Patient_SSN FOREIGN KEY(Patient) REFERENCES Patient(SSN),
  CONSTRAINT fk_Stay_Room_Number FOREIGN KEY(Room) REFERENCES Room(RoomNumber)
);

CREATE TABLE Undergoes (
  Patient INTEGER NOT NULL,
  Procedures INTEGER NOT NULL,
  Stay INTEGER NOT NULL,
  DateUndergoes DATETIME NOT NULL,
  Physician INTEGER NOT NULL,
  AssistingNurse INTEGER,
  PRIMARY KEY(Patient, Procedures, Stay, DateUndergoes),
  CONSTRAINT fk_Undergoes_Patient_SSN FOREIGN KEY(Patient) REFERENCES Patient(SSN),
  CONSTRAINT fk_Undergoes_Procedures_Code FOREIGN KEY(Procedures) REFERENCES Procedures(CODE),
  CONSTRAINT fk_Undergoes_Stay_StayID FOREIGN KEY(Stay) REFERENCES Stay(StayID),
  CONSTRAINT fk_Undergoes_Physician_EmployeeID FOREIGN KEY(Physician) REFERENCES Physician(EmployeeID),
  CONSTRAINT fk_Undergoes_Nurse_EmployeeID FOREIGN KEY(AssistingNurse) REFERENCES Nurse(EmployeeID)
);

 * mysql://root:***@localhost/galaxy
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO Physician VALUES(1,'John Dorian','Staff Internist',111111111);
INSERT INTO Physician VALUES(2,'Elliot Reid','Attending Physician',222222222);
INSERT INTO Physician VALUES(3,'Christopher Turk','Surgical Attending Physician',333333333);
INSERT INTO Physician VALUES(4,'Percival Cox','Senior Attending Physician',444444444);
INSERT INTO Physician VALUES(5,'Bob Kelso','Head Chief of Medicine',555555555);
INSERT INTO Physician VALUES(6,'Todd Quinlan','Surgical Attending Physician',666666666);
INSERT INTO Physician VALUES(7,'John Wen','Surgical Attending Physician',777777777);
INSERT INTO Physician VALUES(8,'Keith Dudemeister','MD Resident',888888888);
INSERT INTO Physician VALUES(9,'Molly Clock','Attending Psychiatrist',999999999);

INSERT INTO Department VALUES(1,'General Medicine',4);
INSERT INTO Department VALUES(2,'Surgery',7);
INSERT INTO Department VALUES(3,'Psychiatry',9);

INSERT INTO Affiliated_With VALUES(1,1,1);
INSERT INTO Affiliated_With VALUES(2,1,1);
INSERT INTO Affiliated_With VALUES(3,1,0);
INSERT INTO Affiliated_With VALUES(3,2,1);
INSERT INTO Affiliated_With VALUES(4,1,1);
INSERT INTO Affiliated_With VALUES(5,1,1);
INSERT INTO Affiliated_With VALUES(6,2,1);
INSERT INTO Affiliated_With VALUES(7,1,0);
INSERT INTO Affiliated_With VALUES(7,2,1);
INSERT INTO Affiliated_With VALUES(8,1,1);
INSERT INTO Affiliated_With VALUES(9,3,1);

INSERT INTO `procedures` VALUES(1,'Reverse Rhinopodoplasty',1500.0);
INSERT INTO `procedures` VALUES(2,'Obtuse Pyloric Recombobulation',3750.0);
INSERT INTO `procedures` VALUES(3,'Folded Demiophtalmectomy',4500.0);
INSERT INTO `procedures` VALUES(4,'Complete Walletectomy',10000.0);
INSERT INTO `procedures` VALUES(5,'Obfuscated Dermogastrotomy',4899.0);
INSERT INTO `procedures` VALUES(6,'Reversible Pancreomyoplasty',5600.0);
INSERT INTO `procedures` VALUES(7,'Follicular Demiectomy',25.0);

INSERT INTO Patient VALUES(100000001,'John Smith','42 Foobar Lane','555-0256',68476213,1);
INSERT INTO Patient VALUES(100000002,'Grace Ritchie','37 Snafu Drive','555-0512',36546321,2);
INSERT INTO Patient VALUES(100000003,'Random J. Patient','101 Omgbbq Street','555-1204',65465421,2);
INSERT INTO Patient VALUES(100000004,'Dennis Doe','1100 Foobaz Avenue','555-2048',68421879,3);

INSERT INTO Nurse VALUES(101,'Carla Espinosa','Head Nurse',1,111111110);
INSERT INTO Nurse VALUES(102,'Laverne Roberts','Nurse',1,222222220);
INSERT INTO Nurse VALUES(103,'Paul Flowers','Nurse',0,333333330);

INSERT INTO Appointment VALUES(13216584,100000001,101,1,'2008-04-24 10:00','2008-04-24 11:00','A');
INSERT INTO Appointment VALUES(26548913,100000002,101,2,'2008-04-24 10:00','2008-04-24 11:00','B');
INSERT INTO Appointment VALUES(36549879,100000001,102,1,'2008-04-25 10:00','2008-04-25 11:00','A');
INSERT INTO Appointment VALUES(46846589,100000004,103,4,'2008-04-25 10:00','2008-04-25 11:00','B');
INSERT INTO Appointment VALUES(59871321,100000004,NULL,4,'2008-04-26 10:00','2008-04-26 11:00','C');
INSERT INTO Appointment VALUES(69879231,100000003,103,2,'2008-04-26 11:00','2008-04-26 12:00','C');
INSERT INTO Appointment VALUES(76983231,100000001,NULL,3,'2008-04-26 12:00','2008-04-26 13:00','C');
INSERT INTO Appointment VALUES(86213939,100000004,102,9,'2008-04-27 10:00','2008-04-21 11:00','A');
INSERT INTO Appointment VALUES(93216548,100000002,101,2,'2008-04-27 10:00','2008-04-27 11:00','B');

INSERT INTO Medication VALUES(1,'Procrastin-X','X','N/A');
INSERT INTO Medication VALUES(2,'Thesisin','Foo Labs','N/A');
INSERT INTO Medication VALUES(3,'Awakin','Bar Laboratories','N/A');
INSERT INTO Medication VALUES(4,'Crescavitin','Baz Industries','N/A');
INSERT INTO Medication VALUES(5,'Melioraurin','Snafu Pharmaceuticals','N/A');

INSERT INTO Prescribes VALUES(1,100000001,1,'2008-04-24 10:47',13216584,'5');
INSERT INTO Prescribes VALUES(9,100000004,2,'2008-04-27 10:53',86213939,'10');
INSERT INTO Prescribes VALUES(9,100000004,2,'2008-04-30 16:53',NULL,'5');

INSERT INTO BLOCK VALUES(1,1);
INSERT INTO BLOCK VALUES(1,2);
INSERT INTO BLOCK VALUES(1,3);
INSERT INTO BLOCK VALUES(2,1);
INSERT INTO BLOCK VALUES(2,2);
INSERT INTO BLOCK VALUES(2,3);
INSERT INTO BLOCK VALUES(3,1);
INSERT INTO BLOCK VALUES(3,2);
INSERT INTO BLOCK VALUES(3,3);
INSERT INTO BLOCK VALUES(4,1);
INSERT INTO BLOCK VALUES(4,2);
INSERT INTO BLOCK VALUES(4,3);

INSERT INTO Room VALUES(101,'Single',1,1,0);
INSERT INTO Room VALUES(102,'Single',1,1,0);
INSERT INTO Room VALUES(103,'Single',1,1,0);
INSERT INTO Room VALUES(111,'Single',1,2,0);
INSERT INTO Room VALUES(112,'Single',1,2,1);
INSERT INTO Room VALUES(113,'Single',1,2,0);
INSERT INTO Room VALUES(121,'Single',1,3,0);
INSERT INTO Room VALUES(122,'Single',1,3,0);
INSERT INTO Room VALUES(123,'Single',1,3,0);
INSERT INTO Room VALUES(201,'Single',2,1,1);
INSERT INTO Room VALUES(202,'Single',2,1,0);
INSERT INTO Room VALUES(203,'Single',2,1,0);
INSERT INTO Room VALUES(211,'Single',2,2,0);
INSERT INTO Room VALUES(212,'Single',2,2,0);
INSERT INTO Room VALUES(213,'Single',2,2,1);
INSERT INTO Room VALUES(221,'Single',2,3,0);
INSERT INTO Room VALUES(222,'Single',2,3,0);
INSERT INTO Room VALUES(223,'Single',2,3,0);
INSERT INTO Room VALUES(301,'Single',3,1,0);
INSERT INTO Room VALUES(302,'Single',3,1,1);
INSERT INTO Room VALUES(303,'Single',3,1,0);
INSERT INTO Room VALUES(311,'Single',3,2,0);
INSERT INTO Room VALUES(312,'Single',3,2,0);
INSERT INTO Room VALUES(313,'Single',3,2,0);
INSERT INTO Room VALUES(321,'Single',3,3,1);
INSERT INTO Room VALUES(322,'Single',3,3,0);
INSERT INTO Room VALUES(323,'Single',3,3,0);
INSERT INTO Room VALUES(401,'Single',4,1,0);
INSERT INTO Room VALUES(402,'Single',4,1,1);
INSERT INTO Room VALUES(403,'Single',4,1,0);
INSERT INTO Room VALUES(411,'Single',4,2,0);
INSERT INTO Room VALUES(412,'Single',4,2,0);
INSERT INTO Room VALUES(413,'Single',4,2,0);
INSERT INTO Room VALUES(421,'Single',4,3,1);
INSERT INTO Room VALUES(422,'Single',4,3,0);
INSERT INTO Room VALUES(423,'Single',4,3,0);

INSERT INTO On_Call VALUES(101,1,1,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(101,1,2,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(102,1,3,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(103,1,1,'2008-11-04 19:00','2008-11-05 03:00');
INSERT INTO On_Call VALUES(103,1,2,'2008-11-04 19:00','2008-11-05 03:00');
INSERT INTO On_Call VALUES(103,1,3,'2008-11-04 19:00','2008-11-05 03:00');

INSERT INTO Stay VALUES(3215,100000001,111,'2008-05-01','2008-05-04');
INSERT INTO Stay VALUES(3216,100000003,123,'2008-05-03','2008-05-14');
INSERT INTO Stay VALUES(3217,100000004,112,'2008-05-02','2008-05-03');

INSERT INTO Undergoes VALUES(100000001,6,3215,'2008-05-02',3,101);
INSERT INTO Undergoes VALUES(100000001,2,3215,'2008-05-03',7,101);
INSERT INTO Undergoes VALUES(100000004,1,3217,'2008-05-07',3,102);
INSERT INTO Undergoes VALUES(100000004,5,3217,'2008-05-09',6,NULL);
INSERT INTO Undergoes VALUES(100000001,7,3217,'2008-05-10',7,101);
INSERT INTO Undergoes VALUES(100000004,4,3217,'2008-05-13',3,103);

INSERT INTO Trained_In VALUES(3,1,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,5,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,7,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(6,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(6,5,'2007-01-01','2007-12-31');
INSERT INTO Trained_In VALUES(6,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,1,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,3,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,4,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,5,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,7,'2008-01-01','2008-12-31');

 * mysql://root:***@localhost/galaxy
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
select * from nurse;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(101, 'Carla Espinosa', 'Head Nurse', 1, 111111110),
 (102, 'Laverne Roberts', 'Nurse', 1, 222222220),
 (103, 'Paul Flowers', 'Nurse', 0, 333333330)]

### 1. 아직 등록되지 않은 간호사의 모든 정보 찾기

In [11]:
%%sql
select * from nurse where not Registered

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(103, 'Paul Flowers', 'Nurse', 0, 333333330)]

### 2. 간호 부서의 책임자 이름 찾기

In [30]:
%%sql
select name, position from nurse where position = 'Head Nurse'

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Carla Espinosa', 'Head Nurse')]

### 3. 각 부서의 책임자인 의사 이름 찾기
[Tables] physician, department

In [33]:
%%sql
select d.name, p.name
from department d join physician p
on d.DepartmentID = p.EmployeeID

 * mysql://root:***@localhost/galaxy
3 rows affected.

[('General Medicine', 'John Dorian'),
 ('Surgery', 'Elliot Reid'),
 ('Psychiatry', 'Christopher Turk')]

In [31]:
%%sql
select * from physician;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [32]:
%%sql
select * from department;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 'General Medicine', 4), (2, 'Surgery', 7), (3, 'Psychiatry', 9)]

### 4. 의사와 진료 예약을 한 환자의 수
[Tables] appointment

In [35]:
%%sql
select * from appointment;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [39]:
%%sql
select count(distinct Patient) as 'No. of patients taken at least one appointment' from appointment

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(4,)]

### 5. 병실 번호 212가 속한 층과 블록 찾기
[Tables] room

In [41]:
%%sql
select * from room;

 * mysql://root:***@localhost/galaxy
36 rows affected.

[(101, 'Single', 1, 1, 0),
 (102, 'Single', 1, 1, 0),
 (103, 'Single', 1, 1, 0),
 (111, 'Single', 1, 2, 0),
 (112, 'Single', 1, 2, 1),
 (113, 'Single', 1, 2, 0),
 (121, 'Single', 1, 3, 0),
 (122, 'Single', 1, 3, 0),
 (123, 'Single', 1, 3, 0),
 (201, 'Single', 2, 1, 1),
 (202, 'Single', 2, 1, 0),
 (203, 'Single', 2, 1, 0),
 (211, 'Single', 2, 2, 0),
 (212, 'Single', 2, 2, 0),
 (213, 'Single', 2, 2, 1),
 (221, 'Single', 2, 3, 0),
 (222, 'Single', 2, 3, 0),
 (223, 'Single', 2, 3, 0),
 (301, 'Single', 3, 1, 0),
 (302, 'Single', 3, 1, 1),
 (303, 'Single', 3, 1, 0),
 (311, 'Single', 3, 2, 0),
 (312, 'Single', 3, 2, 0),
 (313, 'Single', 3, 2, 0),
 (321, 'Single', 3, 3, 1),
 (322, 'Single', 3, 3, 0),
 (323, 'Single', 3, 3, 0),
 (401, 'Single', 4, 1, 0),
 (402, 'Single', 4, 1, 1),
 (403, 'Single', 4, 1, 0),
 (411, 'Single', 4, 2, 0),
 (412, 'Single', 4, 2, 0),
 (413, 'Single', 4, 2, 0),
 (421, 'Single', 4, 3, 1),
 (422, 'Single', 4, 3, 0),
 (423, 'Single', 4, 3, 0)]

In [45]:
%%sql
select BlockFloor as Floor, BlockCode as Block
from room
where RoomNumber in(212);

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(2, 2)]

### 6. 사용 가능한 병실의 수
[Tables] room

In [49]:
%%sql
select count(Unavailable) from room where Unavailable = '0';

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(29,)]

### 7. 사용할 수 없는 병실의 수
[Tables] room

In [50]:
%%sql
select count(Unavailable) from room where Unavailable = '1';

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(7,)]

### 8. 의사의 소속 부서의 이름 찾기

[Tables] physician, department, affiliated_with

In [51]:
%%sql
select * from affiliated_with;

 * mysql://root:***@localhost/galaxy
11 rows affected.

[(1, 1, 1),
 (2, 1, 1),
 (3, 1, 0),
 (3, 2, 1),
 (4, 1, 1),
 (5, 1, 1),
 (6, 2, 1),
 (7, 1, 0),
 (7, 2, 1),
 (8, 1, 1),
 (9, 3, 1)]

In [52]:
%%sql
select * from department;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 'General Medicine', 4), (2, 'Surgery', 7), (3, 'Psychiatry', 9)]

In [53]:
%%sql
select * from physician;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [55]:
%%sql
select p.name, d.name
from physician p join affiliated_with a
on p.EmployeeID = a.Physician
join department d 
on a.Department = d.DepartmentID

 * mysql://root:***@localhost/galaxy
11 rows affected.

[('John Dorian', 'General Medicine'),
 ('Elliot Reid', 'General Medicine'),
 ('Christopher Turk', 'General Medicine'),
 ('Percival Cox', 'General Medicine'),
 ('Bob Kelso', 'General Medicine'),
 ('John Wen', 'General Medicine'),
 ('Keith Dudemeister', 'General Medicine'),
 ('Christopher Turk', 'Surgery'),
 ('Todd Quinlan', 'Surgery'),
 ('John Wen', 'Surgery'),
 ('Molly Clock', 'Psychiatry')]

### 9.치료를 위해 훈련을 받은 의사의 이름 찾기

[Tables] physician, procedure, trained_in

In [62]:
%%sql
select * from physician;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [60]:
%%sql
select * from procedures;

 * mysql://root:***@localhost/galaxy
7 rows affected.

[(1, 'Reverse Rhinopodoplasty', 1500.0),
 (2, 'Obtuse Pyloric Recombobulation', 3750.0),
 (3, 'Folded Demiophtalmectomy', 4500.0),
 (4, 'Complete Walletectomy', 10000.0),
 (5, 'Obfuscated Dermogastrotomy', 4899.0),
 (6, 'Reversible Pancreomyoplasty', 5600.0),
 (7, 'Follicular Demiectomy', 25.0)]

In [58]:
%%sql
select * from trained_in;

 * mysql://root:***@localhost/galaxy
15 rows affected.

[(3, 1, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 5, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 7, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (6, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (6, 5, datetime.datetime(2007, 1, 1, 0, 0), datetime.datetime(2007, 12, 31, 0, 0)),
 (6, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 1, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 3, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 4, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 5, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 7, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0))]

In [63]:
%%sql
select p.name, pro.name
from physician p join trained_in t
on p.EmployeeID = t.Physician
join procedures pro
on pro.CODE = t.Treatment

 * mysql://root:***@localhost/galaxy
15 rows affected.

[('Christopher Turk', 'Reverse Rhinopodoplasty'),
 ('John Wen', 'Reverse Rhinopodoplasty'),
 ('Christopher Turk', 'Obtuse Pyloric Recombobulation'),
 ('Todd Quinlan', 'Obtuse Pyloric Recombobulation'),
 ('John Wen', 'Obtuse Pyloric Recombobulation'),
 ('John Wen', 'Folded Demiophtalmectomy'),
 ('John Wen', 'Complete Walletectomy'),
 ('Christopher Turk', 'Obfuscated Dermogastrotomy'),
 ('Todd Quinlan', 'Obfuscated Dermogastrotomy'),
 ('John Wen', 'Obfuscated Dermogastrotomy'),
 ('Christopher Turk', 'Reversible Pancreomyoplasty'),
 ('Todd Quinlan', 'Reversible Pancreomyoplasty'),
 ('John Wen', 'Reversible Pancreomyoplasty'),
 ('Christopher Turk', 'Follicular Demiectomy'),
 ('John Wen', 'Follicular Demiectomy')]

### 10.부서에 소속되지 않은 의사 이름 찾기
[Tables] physician, affiliated_with, department

In [66]:
%%sql
select * from affiliated_with

 * mysql://root:***@localhost/galaxy
11 rows affected.

[(1, 1, 1),
 (2, 1, 1),
 (3, 1, 0),
 (3, 2, 1),
 (4, 1, 1),
 (5, 1, 1),
 (6, 2, 1),
 (7, 1, 0),
 (7, 2, 1),
 (8, 1, 1),
 (9, 3, 1)]

In [64]:
%%sql
select * from department;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 'General Medicine', 4), (2, 'Surgery', 7), (3, 'Psychiatry', 9)]

In [67]:
%%sql
select * from physician;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [71]:
%%sql
select p.name Physician, p.position position, d.name Department
from physician p join affiliated_with a
on p.EmployeeID = a.Physician	
join department d
on a.Department = d.DepartmentID
where a.PrimaryAffiliation = 0;

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Christopher Turk', 'Surgical Attending Physician', 'General Medicine'),
 ('John Wen', 'Surgical Attending Physician', 'General Medicine')]

### 11. 전문 의사가 아닌 의사의 이름 찾기
[Tables] physician, trained_in

In [72]:
%%sql
select * from physician;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [73]:
%%sql
select * from trained_in;

 * mysql://root:***@localhost/galaxy
15 rows affected.

[(3, 1, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 5, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (3, 7, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (6, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (6, 5, datetime.datetime(2007, 1, 1, 0, 0), datetime.datetime(2007, 12, 31, 0, 0)),
 (6, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 1, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 2, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 3, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 4, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 5, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 6, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0)),
 (7, 7, datetime.datetime(2008, 1, 1, 0, 0), datetime.datetime(2008, 12, 31, 0, 0))]

In [79]:
%%sql
select name Physician, POSITION Designation
from physician
where EmployeeID not in(select distinct Physician from trained_in);

 * mysql://root:***@localhost/galaxy
6 rows affected.

[('John Dorian', 'Staff Internist'),
 ('Elliot Reid', 'Attending Physician'),
 ('Percival Cox', 'Senior Attending Physician'),
 ('Bob Kelso', 'Head Chief of Medicine'),
 ('Keith Dudemeister', 'MD Resident'),
 ('Molly Clock', 'Attending Psychiatrist')]

### 12.치료한 의사가 있는 환자의 이름 찾기
[Tables] patient, physician

In [97]:
%%sql
select * from patient

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [98]:
%%sql
select pa.name patient, pa.Address, p.name physician
from patient pa join physician p
on pa.pcp = p.EmployeeID
where PCP is not null;

 * mysql://root:***@localhost/galaxy
4 rows affected.

[('John Smith', '42 Foobar Lane', 'John Dorian'),
 ('Grace Ritchie', '37 Snafu Drive', 'Elliot Reid'),
 ('Random J. Patient', '101 Omgbbq Street', 'Elliot Reid'),
 ('Dennis Doe', '1100 Foobaz Avenue', 'Christopher Turk')]

### 13.환자의 이름과 진료가 예약된 의사의 수 찾기

[Tables] appointment, patient

In [100]:
%%sql
select * from patient;

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [99]:
%%sql
select * from appointment;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [106]:
%%sql
select p.name patient, count(a.patient) as 'Appointment for No. of Physicians'
from patient p join appointment a
on p.SSN = a.patient
group by p.name

 * mysql://root:***@localhost/galaxy
4 rows affected.

[('John Smith', 3),
 ('Grace Ritchie', 2),
 ('Random J. Patient', 1),
 ('Dennis Doe', 3)]

### 14. 검사실(examination room) C에 예약한 고유 환자의 수를 계산
[Tables] appointment

In [108]:
%%sql
select * from appointment;

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [109]:
%%sql
select count(ExaminationRoom) as 'No. of patients got appoint for room C'
from appointment
where ExaminationRoom = 'C'

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(3,)]

### 15. 환자의 이름과 치료를 위해 가야 할 검사실의 수를 계산
[Tables] patient, appointment

In [118]:
%%sql
select * from appointment

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [113]:
%%sql
select * from patient;

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [8]:
%%sql
select p.name Patient, 
    count(a.Patient) as 'Number of the room',
    group_concat(a.ExaminationRoom) 
from appointment a join patient p
on a.Patient = p.SSN
group by a.Patient
order by p.name

 * mysql://root:***@localhost/galaxy
4 rows affected.

[('Dennis Doe', 3, 'B,C,A'),
 ('Grace Ritchie', 2, 'B,B'),
 ('John Smith', 3, 'A,A,C'),
 ('Random J. Patient', 1, 'C')]

### 16. 간호사의 이름과 예약된 방 찾기
[Tables] nurse, appointment

In [9]:
%%sql
select * from nurse;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(101, 'Carla Espinosa', 'Head Nurse', 1, 111111110),
 (102, 'Laverne Roberts', 'Nurse', 1, 222222220),
 (103, 'Paul Flowers', 'Nurse', 0, 333333330)]

In [10]:
%%sql
select * from appointment

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [11]:
%%sql
select n.name as 'Name of the Nurse', 
    a.ExaminationRoom as 'Room No.'
from nurse n join appointment a
on n.EmployeeID = a.PrepNurse

 * mysql://root:***@localhost/galaxy
7 rows affected.

[('Carla Espinosa', 'A'),
 ('Carla Espinosa', 'B'),
 ('Carla Espinosa', 'B'),
 ('Laverne Roberts', 'A'),
 ('Laverne Roberts', 'A'),
 ('Paul Flowers', 'B'),
 ('Paul Flowers', 'C')]

### 17. 4월 25일 오전 10시에 진료 예약을 한 환자의 이름 찾기. 의사와 간호사, 진료실 번호도 표시
[Tables] patient, appointment, nurse, physician

In [12]:
%%sql
select * from patient

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [13]:
%%sql
select * from appointment

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [14]:
%%sql
select * from nurse

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(101, 'Carla Espinosa', 'Head Nurse', 1, 111111110),
 (102, 'Laverne Roberts', 'Nurse', 1, 222222220),
 (103, 'Paul Flowers', 'Nurse', 0, 333333330)]

In [15]:
%%sql
select * from physician

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [18]:
%%sql
select pat.name as 'Name of the patient',
    n.name as 'Name of the Nuerse assisting the physician',
    ph.name as 'Name of the physician',
    a.ExaminationRoom as 'Room No.',
    a.START start
from patient pat join appointment a
on pat.ssn = a.Patient
join physician ph
on a.Physician = ph.EmployeeID
join nurse n
on a.PrepNurse = n.EmployeeID
where a.START = '2008-04-25 10:00:00'

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('John Smith', 'Laverne Roberts', 'John Dorian', 'A', datetime.datetime(2008, 4, 25, 10, 0)),
 ('Dennis Doe', 'Paul Flowers', 'Percival Cox', 'B', datetime.datetime(2008, 4, 25, 10, 0))]

### 18. 간호사의 도움이 필요 없는 환자와 의사의 이름 찾기
[Tables] patient, appointment, physician

In [23]:
%%sql
select * from patient

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [26]:
%%sql
select * from appointment

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(13216584, 100000001, 101, 1, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'A'),
 (26548913, 100000002, 101, 2, datetime.datetime(2008, 4, 24, 10, 0), datetime.datetime(2008, 4, 24, 11, 0), 'B'),
 (36549879, 100000001, 102, 1, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'A'),
 (46846589, 100000004, 103, 4, datetime.datetime(2008, 4, 25, 10, 0), datetime.datetime(2008, 4, 25, 11, 0), 'B'),
 (59871321, 100000004, None, 4, datetime.datetime(2008, 4, 26, 10, 0), datetime.datetime(2008, 4, 26, 11, 0), 'C'),
 (69879231, 100000003, 103, 2, datetime.datetime(2008, 4, 26, 11, 0), datetime.datetime(2008, 4, 26, 12, 0), 'C'),
 (76983231, 100000001, None, 3, datetime.datetime(2008, 4, 26, 12, 0), datetime.datetime(2008, 4, 26, 13, 0), 'C'),
 (86213939, 100000004, 102, 9, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 21, 11, 0), 'A'),
 (93216548, 100000002, 101, 2, datetime.datetime(2008, 4, 27, 10, 0), datetime.datetime(2008, 4, 27, 11, 0), 'B')]

In [27]:
%%sql
select * from physician

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [9]:
%%sql
select pa.NAME as 'Name of the patient', 
    ph.name as 'Name of the physician' ,
    a.ExaminationRoom as 'Room No.'
from appointment a join patient pa
on a.Patient = pa.SSN
join physician ph
on a.Physician = ph.EmployeeID
where a.PrepNurse is null

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Dennis Doe', 'Percival Cox', 'C'), ('John Smith', 'Christopher Turk', 'C')]

### 19. 환자의 이름, 치료 의사, 약물 찾기
[Tables] patient, prescribes, physician, medication

In [10]:
%%sql
select * from patient

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [11]:
%%sql
select * from prescribes

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 100000001, 1, datetime.datetime(2008, 4, 24, 10, 47), 13216584, '5'),
 (9, 100000004, 2, datetime.datetime(2008, 4, 27, 10, 53), 86213939, '10'),
 (9, 100000004, 2, datetime.datetime(2008, 4, 30, 16, 53), None, '5')]

In [12]:
%%sql
select * from physician

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [13]:
%%sql
select * from medication

 * mysql://root:***@localhost/galaxy
5 rows affected.

[(1, 'Procrastin-X', 'X', 'N/A'),
 (2, 'Thesisin', 'Foo Labs', 'N/A'),
 (3, 'Awakin', 'Bar Laboratories', 'N/A'),
 (4, 'Crescavitin', 'Baz Industries', 'N/A'),
 (5, 'Melioraurin', 'Snafu Pharmaceuticals', 'N/A')]

In [20]:
%%sql
select pa.name Patient, ph.name Physician, m.name Medication
from prescribes pr join patient pa
on pr.Patient = pa.SSN
join physician ph
on pr.Physician = ph.EmployeeID
join medication m
on pr.Medication = m.CODE

 * mysql://root:***@localhost/galaxy
3 rows affected.

[('John Smith', 'John Dorian', 'Procrastin-X'),
 ('Dennis Doe', 'Molly Clock', 'Thesisin'),
 ('Dennis Doe', 'Molly Clock', 'Thesisin')]

### 20. 사전 예약을 한 환자의 이름과 의사, 약물을 찾기
[Tables] patient, prescribes, physician, medication

In [21]:
%%sql
select *
from prescribes

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 100000001, 1, datetime.datetime(2008, 4, 24, 10, 47), 13216584, '5'),
 (9, 100000004, 2, datetime.datetime(2008, 4, 27, 10, 53), 86213939, '10'),
 (9, 100000004, 2, datetime.datetime(2008, 4, 30, 16, 53), None, '5')]

In [22]:
%%sql
select * from patient

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(100000001, 'John Smith', '42 Foobar Lane', '555-0256', 68476213, 1),
 (100000002, 'Grace Ritchie', '37 Snafu Drive', '555-0512', 36546321, 2),
 (100000003, 'Random J. Patient', '101 Omgbbq Street', '555-1204', 65465421, 2),
 (100000004, 'Dennis Doe', '1100 Foobaz Avenue', '555-2048', 68421879, 3)]

In [23]:
%%sql
select * from physician

 * mysql://root:***@localhost/galaxy
9 rows affected.

[(1, 'John Dorian', 'Staff Internist', 111111111),
 (2, 'Elliot Reid', 'Attending Physician', 222222222),
 (3, 'Christopher Turk', 'Surgical Attending Physician', 333333333),
 (4, 'Percival Cox', 'Senior Attending Physician', 444444444),
 (5, 'Bob Kelso', 'Head Chief of Medicine', 555555555),
 (6, 'Todd Quinlan', 'Surgical Attending Physician', 666666666),
 (7, 'John Wen', 'Surgical Attending Physician', 777777777),
 (8, 'Keith Dudemeister', 'MD Resident', 888888888),
 (9, 'Molly Clock', 'Attending Psychiatrist', 999999999)]

In [29]:
%%sql
select * from medication

 * mysql://root:***@localhost/galaxy
5 rows affected.

[(1, 'Procrastin-X', 'X', 'N/A'),
 (2, 'Thesisin', 'Foo Labs', 'N/A'),
 (3, 'Awakin', 'Bar Laboratories', 'N/A'),
 (4, 'Crescavitin', 'Baz Industries', 'N/A'),
 (5, 'Melioraurin', 'Snafu Pharmaceuticals', 'N/A')]

In [32]:
%%sql
select pa.name Patient, ph.name Physician, m.name Medication
from patient pa join prescribes pr
on pa.SSN = pr.Patient
join physician ph
on pr.Physician = ph.EmployeeID
join medication m
on pr.Medication = m.CODE
where pr.Appointment is not null;

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('John Smith', 'John Dorian', 'Procrastin-X'),
 ('Dennis Doe', 'Molly Clock', 'Thesisin')]

### 21. 사전 예약을 하지 않은 환자의 이름과 의사, 약물 찾기
[Tables] patient, prescribes, physician, medication

In [33]:
%%sql
select pa.name Patient, ph.name Physician, m.name Medication
from patient pa join prescribes pr
on pa.SSN = pr.Patient
join physician ph
on pr.Physician = ph.EmployeeID
join medication m
on pr.Medication = m.CODE
where pr.Appointment is null;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Dennis Doe', 'Molly Clock', 'Thesisin')]

### 22. 각 블록에서 사용 가능한 병실의 수를 계산
[Tables] room

In [43]:
%%sql
select BlockCode Block, count(BlockCode) as 'Number of available rooms' 
from room
where Unavailable = 0
group by BlockCode;

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(1, 9), (2, 10), (3, 10)]

### 23. 각 층에서 사용 가능한 병실의 수를 계산
[Tables] room

In [44]:
%%sql
select * from room

 * mysql://root:***@localhost/galaxy
36 rows affected.

[(101, 'Single', 1, 1, 0),
 (102, 'Single', 1, 1, 0),
 (103, 'Single', 1, 1, 0),
 (111, 'Single', 1, 2, 0),
 (112, 'Single', 1, 2, 1),
 (113, 'Single', 1, 2, 0),
 (121, 'Single', 1, 3, 0),
 (122, 'Single', 1, 3, 0),
 (123, 'Single', 1, 3, 0),
 (201, 'Single', 2, 1, 1),
 (202, 'Single', 2, 1, 0),
 (203, 'Single', 2, 1, 0),
 (211, 'Single', 2, 2, 0),
 (212, 'Single', 2, 2, 0),
 (213, 'Single', 2, 2, 1),
 (221, 'Single', 2, 3, 0),
 (222, 'Single', 2, 3, 0),
 (223, 'Single', 2, 3, 0),
 (301, 'Single', 3, 1, 0),
 (302, 'Single', 3, 1, 1),
 (303, 'Single', 3, 1, 0),
 (311, 'Single', 3, 2, 0),
 (312, 'Single', 3, 2, 0),
 (313, 'Single', 3, 2, 0),
 (321, 'Single', 3, 3, 1),
 (322, 'Single', 3, 3, 0),
 (323, 'Single', 3, 3, 0),
 (401, 'Single', 4, 1, 0),
 (402, 'Single', 4, 1, 1),
 (403, 'Single', 4, 1, 0),
 (411, 'Single', 4, 2, 0),
 (412, 'Single', 4, 2, 0),
 (413, 'Single', 4, 2, 0),
 (421, 'Single', 4, 3, 1),
 (422, 'Single', 4, 3, 0),
 (423, 'Single', 4, 3, 0)]

In [45]:
%%sql
select BlockFloor Floor, count(BlockFloor) as 'Number of available rooms' 
from room
where Unavailable = 0
group by BlockFloor;

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(1, 8), (2, 7), (3, 7), (4, 7)]

### 24. 각 층의 각 블록에 대해 사용 가능한 병실의 수를 계산
[Tables] room

In [48]:
%%sql
select BlockFloor Floor, BlockCode Block, count(BlockFloor) as 'Number of available rooms' 
from room
where Unavailable = 0
group by BlockCode, BlockFloor;

 * mysql://root:***@localhost/galaxy
12 rows affected.

[(1, 1, 3),
 (1, 2, 2),
 (1, 3, 3),
 (2, 1, 2),
 (2, 2, 2),
 (2, 3, 3),
 (3, 1, 2),
 (3, 2, 3),
 (3, 3, 2),
 (4, 1, 2),
 (4, 2, 3),
 (4, 3, 2)]

### 25. 각 층의 각 블록에 대해 사용할 수 없는 병실의 수를 계산
[Tables] room

In [49]:
%%sql
select BlockFloor Floor, BlockCode Block, count(BlockFloor) as 'Number of available rooms' 
from room
where Unavailable != 0
group by BlockCode, BlockFloor;

 * mysql://root:***@localhost/galaxy
7 rows affected.

[(1, 2, 1), (2, 1, 1), (2, 2, 1), (3, 1, 1), (3, 3, 1), (4, 1, 1), (4, 3, 1)]